InformationRegisters/ЛБ_ДатыЗагрузкиПеречней.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ДатыЗагрузкиПеречней</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ВидПроверки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыПроверкиПеречней</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПеречня</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыПеречней</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаПеречня</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РазмерФайла</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ЛБ_ВидыОперацийОперацияПоЗалогу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыОперацийОперацияПоЗалогу</Name>
			<Comment>Виды операций документа "Операция по залогу"</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Залог</Name>
					<Comment>Выдача займа под залог</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПроцентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Переоформление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаЗалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзъятиеОбъектовЗалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОбъектовЗалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаЗалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаПереоформления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОстановкаПроцентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаОплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаВыдачиСОХ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаИзъятия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаВозвратаИзъятого</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаОстановкиНачисленияПроцентов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonForms/ЛБ_ФормаИсторииОбновленияПеречней/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ВидПеречня") Тогда
		ВидПеречня = Параметры.ВидПеречня; 
		ЭтаФорма.Заголовок = "Даты проверки перечня " + Строка(ВидПеречня);
	Иначе
		Сообщить("Не выбран вид перечня!");
		возврат;
	КонецЕсли;	 
	
	Если Параметры.Свойство("ДатаПроверки") Тогда   
		ДатаПроверки = Параметры.ДатаПроверки;
	иначе	
		ДатаПроверки = ТекущаяДата();
	КонецЕсли;
	
	Если Параметры.Свойство("Клиент") Тогда 
		Клиент = Параметры.Клиент;
	КонецЕсли;	
	
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("ВидПеречня", ВидПеречня);
	Запрос.УстановитьПараметр("Дата", ДатаПроверки);
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Запрос.Текст ="ВЫБРАТЬ РАЗЛИЧНЫЕ
	              |	ЛБ_ДатыЗагрузкиПеречней.Период КАК Период,
	              |	ЛБ_ДатыЗагрузкиПеречней.ДатаПеречня КАК ДатаПеречня,
	              |	ЛБ_ДатыЗагрузкиПеречней.ВидПроверки КАК ВидПроверки,
	              |	ЛБ_ДатыЗагрузкиПеречней.Ответственный КАК Ответственный
	              |ИЗ
	              |	РегистрСведений.ЛБ_ДатыЗагрузкиПеречней КАК ЛБ_ДатыЗагрузкиПеречней
	              |ГДЕ
	              |	ЛБ_ДатыЗагрузкиПеречней.ВидПеречня = &ВидПеречня
	              |	И ЛБ_ДатыЗагрузкиПеречней.Период <= &Дата
	              |
	              |УПОРЯДОЧИТЬ ПО
	              |	Период";  
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить(); 
	ТаблицаЗапроса.Колонки.Добавить("ВидПроверкиАнкета");
	
	ВидыОперации = Новый СписокЗначений; 
	ВидыОперации.Добавить(Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Залог);
	ВидыОперации.Добавить(Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление);
	ВидыОперации.Добавить(Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОплатаПроцентов);
	ВидыОперации.Добавить(Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ВыдачаЗалога);
	Запрос.УстановитьПараметр("ВидыОперации", ВидыОперации);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_КарточкаЗалогодателя.Дата КАК Период,
	               |	ЛБ_КарточкаЗалогодателя.Ответственный КАК Ответственный,
	               |	0 КАК Вид
	               |ИЗ
	               |	Документ.ЛБ_КарточкаЗалогодателя КАК ЛБ_КарточкаЗалогодателя
	               |ГДЕ
	               |	ЛБ_КарточкаЗалогодателя.Дата <= &Дата
	               |	И ЛБ_КарточкаЗалогодателя.Проведен = ИСТИНА
	               |	И ЛБ_КарточкаЗалогодателя.Залогодатель = &Клиент
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ЛБ_ОперацияПоЗалогу.Дата,
	               |	ЛБ_ОперацияПоЗалогу.ОтветственныйСотрудник,
	               |	1
	               |ИЗ
	               |	Документ.ЛБ_ОперацияПоЗалогу КАК ЛБ_ОперацияПоЗалогу
	               |ГДЕ
	               |	ЛБ_ОперацияПоЗалогу.Дата <= &Дата
	               |	И ЛБ_ОперацияПоЗалогу.Проведен = ИСТИНА
	               |	И ЛБ_ОперацияПоЗалогу.Залогодатель = &Клиент
	               |	И ЛБ_ОперацияПоЗалогу.ВидОперации В(&ВидыОперации)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Период";  
	Выборка = Запрос.Выполнить().Выбрать();
	Ном = 0;   
	ДатаОформленияАнкеты = Дата(1,1,1);
	Пока Выборка.Следующий() цикл 
		СтрП  = ТаблицаЗапроса.Добавить(); 
		СтрП.Период = Выборка.Период; 
		СтрП.Ответственный = Выборка.Ответственный;  
		Если Выборка.Вид = 0 Тогда
			Если Ном = 0 Тогда
			    СтрП.ВидПроверкиАнкета = "Оформление анкеты клиента"; 
				ДатаОформленияАнкеты = Выборка.Период;
			Иначе   
				СтрП.ВидПроверкиАнкета = "Изменение анкеты клиента";
			КонецЕсли;	
			Ном = Ном + 1;   
		Иначе 
			СтрП.ВидПроверкиАнкета = "Оформление операции по займу";
		КонецЕсли;	
	Конеццикла;	 
	
	Для каждого Стр Из ТаблицаЗапроса Цикл  
		Если Стр.Период < ДатаОформленияАнкеты Тогда
			Продолжить;
		КонецЕсли;	
		НоваяСтр = ТаблицаОбновлений.Добавить();
		НоваяСтр.ДатаПроверки = Стр.Период; 
		НоваяСтр.ДатаПеречня = Стр.ДатаПеречня; 
		НоваяСтр.ВидПроверки = ?(ЗначениеЗаполнено(Стр.ВидПроверки), Стр.ВидПроверки, Стр.ВидПроверкиАнкета);
		НоваяСтр.Ответственный = стр.Ответственный;
	Конеццикла;
	ТаблицаОбновлений.Сортировать("ДатаПроверки Убыв, ДатаПеречня Убыв");

КонецПроцедуры
